# Итоговая проверочная работа
## Условия задачи

### Создать репозиторий на GitHub
### Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
### Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
### Написать программу, решающую поставленную задачу
### Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

## Задача:

***Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.***

Примеры:
- [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
- [“1234”, “1567”, “-2”, “computer science”] → [“-2”]
- [“Russia”, “Denmark”, “Kazan”] → []

## Решение

### Функция Commands, которая выводит список команд для выбора массива.
``` 
void Commands()
{
    Console.WriteLine();
    Console.WriteLine("СПИСОК КОМАНД:");
    Console.WriteLine("1 - использовать массив: [“Hello”, “2”, “world”, “:-)”]");
    Console.WriteLine("2 - использовать массив: [“1234”, “1567”, “-2”, “computer science”]");
    Console.WriteLine("3 - использовать массив: [“Russia”, “Denmark”, “Kazan”]");
    Console.WriteLine();
} 
```

### Функция ReadInput, которая выводит сообщение и считывает введенную пользователем команду.
```
string ReadInput(string msg)
{
    Console.Write(msg);
    return Console.ReadLine();
}

void PrintArray(string[] array)
{
    Console.Write("[ ");
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"“{array[i]}”, ");
    }
    Console.Write("] ");
}
```
### Далее вызывается функция Commands для отображения списка доступных команд. Затем программа создает пустой массив array.
```
Commands();
string[] array = new string[] {};
```
### После этого программа считывает введенную пользователем команду и с помощью оператора switch выбирает соответствующий массив для использования. Если команда не совпадает ни с одной из предложенных, программа выводит сообщение о том, что такой команды нет.
```
string fromUser = ReadInput("Введите команду: ");
switch (fromUser)
{
    case "1":
        array = new string[] { "Hello", "2", "world", ":-)" };
        break;
    case "2":
        array = new string[] { "1234", "1567", "-2", "computer science" };
        break;
    case "3":
        array = new string[] { "Russia", "Denmark", "Kazan" };
        break;
    default:
        Console.WriteLine($"{fromUser} - Такой команды нет");
        break;
}
```
### Программа подсчитывает количество элементов в массиве array, длина строки которых не превышает 3 символа, и записывает это количество в переменную lengthNewArray
```
int lengthNewArray = 0;
for (int i = 0; i <= array.Length - 1; i++)
{
    if (array[i].Length <= 3) lengthNewArray++;
}
```
### Создается новый массив newArray с размером, равным lengthNewArray. Затем с помощью цикла for происходит проход по массиву array и копирование элементов в newArray, если длина строки не превышает 3 символа.
```
string[] newArray = new string[lengthNewArray];
int idx = 0;

for (int i = 0; i <= array.Length - 1; i++)
{
    if (array[i].Length <= 3)
    {
        newArray[idx] = array[i];
        idx++;
    }
}
```
### Программа выводит исходный массив array и новый массив newArray.
```
PrintArray(array);
Console.Write("→ ");
PrintArray(newArray);
```